@yupwei68 thank you for your reply.
here below, informations given by `terraform plan` :

```terraform
 # azurerm_postgresql_database.database[0] will be created
   + resource "azurerm_postgresql_database" "database" {
       + charset             = "UTF8"
       + collation           = "fr-FR"
       + id                  = (known after apply)
       + name                = "myapp"
       + resource_group_name = "rg-xx-xxxx-myapp-frct-01"
       + server_name         = "pgsql-xx-myapp-frct-01"
     }
   # azurerm_postgresql_server.server will be created
   + resource "azurerm_postgresql_server" "server" {
       + administrator_login              = "myapp"
       + administrator_login_password     = (sensitive value)
       + auto_grow_enabled                = false
       + backup_retention_days            = 7
       + create_mode                      = "Default"
       + fqdn                             = (known after apply)
       + geo_redundant_backup_enabled     = (known after apply)
       + id                               = (known after apply)
       + location                         = "francecentral"
       + name                             = "pgsql-xx-myapp-frct-01"
       + public_network_access_enabled    = false
       + resource_group_name              = "rg-xx-xxxx-myapp-frct-01"
       + sku_name                         = "B_Gen5_1"
       + ssl_enforcement                  = (known after apply)
       + ssl_enforcement_enabled          = true
       + ssl_minimal_tls_version_enforced = "TLS1_2"
       + storage_mb                       = 5120
       + tags                             = {
           + "dbmsType"    = "postgresql"
           + "dbmsVersion" = "11"
           + "environment" = "myenv"
           + "owner"       = "myteam"
           + "provider"    = "terraform"
           + "role"        = "xxxx"
           + "service"     = "myapp"
         }
       + version                          = "11"
       + storage_profile {
           + auto_grow             = (known after apply)
           + backup_retention_days = (known after apply)
           + geo_redundant_backup  = (known after apply)
           + storage_mb            = (known after apply)
         }
     }
 Plan: 2 to add, 0 to change, 0 to destroy.
```

@larsmaes I was using 2.9 when posting this issue.
Since 2.10 release, it seems to be worst unfortunaly. 
